Tekla Open API Reference for Tekla Structures 2025
DistanceList.Count Property
 Gets the number of items in the list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
 Number of items in the list.
Implements
ICollection<T>.Count
Examples
 This example shows how the get the number of Distance instances in a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // We'll use this distance list to demonstrate the Count property.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           int distanceCount = distanceList.Count;
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace